---
kind: method
id: M:Autodesk.Revit.DB.LeaderArray.GetEnumerator
source: html/c68f6687-28fc-613b-80e2-30576d22180a.htm
---
# Autodesk.Revit.DB.LeaderArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.